// Пользователь вводит номер месяц. Необходимо вывести пору года по номеру
// месяца (2 способа)

// let a = +prompt('введите номер месяца');
// switch (a) {
//     case 1: case 2: case 12:
//         alert('зима,холода, одинокие года');
//         break;
//     case 3: case 4: case 5:
//         alert('пришла весна');
//         break;
//     case 6: case 7: case 8:
//         alert('лето,солнце, жара');
//         break;
//     case 9: case 10: case 11:
//         alert('осень');
//         break;
// }
// if(a>=3&&a<=5)
// {
//     alert('spring');
// }
// else if(a>=6&&a<=8)
// {
//     alert('summer');
// }
// else if(a>=9&&a<=11)
// {
//     alert('autumn');
// }
// else if(a==12||a==1||a==2){
//     alert('winter');
// }
// else{
//     alert('неверное число');
// }

// 9. Пользователь вводит число: 1, 2, 3 или 4. Если это значение '1', то вывести в консоль
// 'зима', '2' – 'весна' и так далее. Добавить проверку на ввод только чисел. Решите
// задачу через switch-case. 

// let a = +prompt();
// if(isNaN(a)){
//     alert('error');
// }
// else{
//     switch(a){
//         case 1: alert('зима'); break;
//         case 2: alert('весна'); break;
//         case 3: alert('лето'); break;
//         case 4: alert('осень'); break;
//         default: alert('error');

//     }
// }
// 10. Пользователь вводит одно число. Необходимо вывести обратное ему (число
//     является обратным при 1/x). Если при этом введённое с клавиатуры число – ноль,
//     то вывести «Обратного числа не существует». Добавить проверку на ввод только
//     чисел


    // 11. Напишите программу, которая находит полное число метров по заданному числу
    // сантиметров. Добавить проверку на ввод только чисел
    // 345 -> 3
    // 100 -> 1
// const g= prompt();
// if(isNaN(g)){
//     alert('error');
// }
// else{
//     alert(`${g/100} метров`);
// }



    // 12. Напишите программу, в которой рассчитывается сумма и произведение цифр
    // положительного трёхзначного числа
    // 123 -> Сумма цифр = 6 Произведение цифр = 6

    